a = [
    [0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0],
    [0,0,0,0,0,0,0,0]
]
for row in a:                  # 外层循环：每次拿到一行
    for x in row:              # 内层循环：每次拿到这一行里的一个数字
        print(x,end='  ')      # 打印这个数字，后面加空格，不换行
    print()                    # 这一行打印完了，换到下一行

#以上是对image的规整画法
#def
print('----------------------------------------------------')
def show(a):
    for row in a:
        for x in row:
            print(x,end='  ')
        print()

a[4][5] =1
show(a)
print('-------------------------------------------------------')
 #查找‘亮处’
for r in range(len(a)):
    for c in range(len(a[r])):
        if a[r][c] == 1:
            print(r,',',c,'亮处')